test/artillery.yml
config:
  target: 'http://localhost:8000'
  phases:
      - duration: 60
        arrivalRate: 5
      - duration: 120
        arrivalRate: 5
        rampTo: 50
      - duration: 600
        arrivalRate: 50
  defaults:
    headers:
      memory-share: 'MTUyMzk4MTMyNnxEdi1CQkFFQ180SUFBUkFCRUFBQVZQLUNBQUlHYzNSeWFXNW5EQThBRFdGMWRHaGxiblJwWTJGMFpXUUVZbTl2YkFJQ0FBRUdjM1J5YVc1bkRBY0FCV1Z0WVdsc0JuTjBjbWx1Wnd3V0FCUnFaVzFuZFc1aGVVQjVZV2h2Ynk1amJ5NTFhdz09fAHpiBlG-lz1cG79Da8tDV4z0XsguxxX8QXvMwX-Kx2V'
  payload:
    path: "test_data.csv"
    fields:
      - "username"
      - "password"

scenarios:
  - flow:
    - get:
        url: "/"
    - get:
        url: "/search"
    - get:
        url: "/data?fetch=tags,people,file_types,dates"
    - get:
        url: "/users"